In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({
    "col1":[1,2,3,4],
    "col2":[10,20,30,40],
    "col3":["a","b","c","d"]
})
print(df)

   col1  col2 col3
0     1    10    a
1     2    20    b
2     3    30    c
3     4    40    d

In [3]:
df['col4']=df['col1']+df['col2']

In [4]:
df

   col1  col2 col3  col4
0     1    10    a    11
1     2    20    b    22
2     3    30    c    33
3     4    40    d    44

In [5]:
df['col2'].mean()

25.0

In [6]:
df['col2'].unique()

array([10, 20, 30, 40])

In [7]:
df['col2'].nunique()

4

In [8]:
## apply function
def times2(x):
    return x*2

In [9]:
df['col2'].apply(times2)

0    20
1    40
2    60
3    80
Name: col2, dtype: int64

In [12]:
df['col1'].sum()

10

In [13]:
df

   col1  col2 col3  col4
0     1    10    a    11
1     2    20    b    22
2     3    30    c    33
3     4    40    d    44

In [14]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
 3   col4    4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
df.sort_values('col2')

   col1  col2 col3  col4
0     1    10    a    11
1     2    20    b    22
2     3    30    c    33
3     4    40    d    44

In [19]:
df.isnull()

    col1   col2   col3   col4
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [20]:
df.dropna()

   col1  col2 col3  col4
0     1    10    a    11
1     2    20    b    22
2     3    30    c    33
3     4    40    d    44

In [21]:
import numpy as np

In [ ]:
df=